notes.tex
% Created 2026-01-08 Thu 08:42
% Intended LaTeX compiler: pdflatex
\documentclass[a4, 12pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{minted}
\usepackage{subfiles}
\usepackage{subcaption}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{amsthm}
\usepackage{bbm}
\usepackage{graphicx}
\usepackage{fancyvrb}
\usepackage{xparse}
\usepackage{parskip}
\usepackage{stmaryrd}
\usepackage{cjhebrew}
\usepackage{derivative}
\usepackage{mathtools}
\usepackage{esint}
\usepackage{xcolor}
\usepackage{minted}
\usepackage{verbatim}
\definecolor{bg}{rgb}{.9,.9,.9}
\usepackage[backgroundcolor=bg, skipbelow=10, skipabove=10]{mdframed}
\usemintedstyle{emacs}
\surroundwithmdframed{minted}
\surroundwithmdframed{verbatim}
\usepackage[margin=2cm]{geometry}
\usepackage[shortlabels]{enumitem}
\newcommand{\aaa}{\text{*}}
\newcommand{\bC}{\mathbb{C}}
\newcommand{\bR}{\mathbb{R}}
\newcommand{\bQ}{\mathbb{Q}}
\newcommand{\bZ}{\mathbb{Z}}
\newcommand{\bN}{\mathbb{N}}
\newcommand{\bD}{\mathbb{D}}
\newcommand{\bP}{\mathbb{P}}
\newcommand{\bE}{\mathbb{E}}
\newcommand{\cA}{\mathcal{A}}
\newcommand{\cB}{\mathcal{B}}
\newcommand{\cC}{\mathcal{C}}
\newcommand{\cD}{\mathcal{D}}
\newcommand{\cE}{\mathcal{E}}
\newcommand{\cR}{\mathcal{R}}
\newcommand{\cQ}{\mathcal{Q}}
\newcommand{\cZ}{\mathcal{Z}}
\newcommand{\cN}{\mathcal{N}}
\newcommand{\cP}{\mathcal{P}}
\newcommand{\cL}{\mathcal{L}}
\newcommand{\cF}{\mathcal{F}}
\newcommand{\cM}{\mathcal{M}}
\newcommand{\dd}{\, \mathrm{d}}
\newcommand{\nrm}[1]{\Vert #1 \Vert}
\author{Alexander Speigle}
\date{\today}
\title{Math 658 Notes}
\hypersetup{
 pdfauthor={Alexander Speigle},
 pdftitle={Math 658 Notes},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 30.2 (Org mode 9.7.11)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents

\section{Lecture 1 - August 25}
\label{sec:org98bb6cb}
\subsection{Books}
\label{sec:orge87192b}
\begin{description}
\item[{Nonholonomic Dynamics and Control}] Anthony Bloch
\item[{Differential Equations, Dynamical Systems, and an Introduction to Chaos}] Hirsh, Smale, Devaney
\item[{Mathematical Methods of Classical Mechanics}] Vladimir Arnol'd
\item[{Introduction to Mechanics and Symmetry}] Ratiu and Marsden
\item[{Foundations of Mechanics}] Abraham, Marsden, and Ratiu
\item[{Classical Mechanics}] Goldstein
\item[{Classical Mechanics}] Whitaker
\item[{Nonlinear Oscillations, Dynamical Systems, and Bifurcations of Vector Fields}] Guckenheimer and Holmes
\end{description}
\end{document}
